[
  {
    "title": "Unsung Heroes",
    "images": [
      "images/unsungHeroes/unsung1.png",
      "images/unsungHeroes/unsung2.png"
    ],
    "link": "https://heroes.apsoprojects.org/",
    "tools": [
      "ReactJS",
      "JavaScript",
      "HTML",
      "CSS",
      "Flexbox"
    ],
    "description": {
      "brief": "Unsung Heroes is a web application built with ReactJS that aims to recognize and nominate students on campus for their outstanding accomplishments. It features a responsive user interface, including a home page with a dynamic carousel.",
      "long": "Unsung Heroes is an impressive web application built with ReactJS that celebrates the achievements of deserving students on campus. Through this project, I crafted a visually captivating home page featuring a dynamic carousel that displays inspiring quotes.\n\nBy leveraging ReactJS components, I successfully implemented a carousel feature, allowing for seamless display of quotes pulled from user nominations. This demonstrates my ability to create engaging and interactive user interfaces using React.\n\nIn addition, Unsung Heroes includes a nomination form that provides a user-friendly experience for submitting nominations. The form incorporates validation techniques to ensure accurate and complete submissions, highlighting my attention to detail and commitment to delivering high-quality user experiences.\n\nThe heroes page, a crucial component of Unsung Heroes, leverages ReactJS to retrieve and display data from a backend source. I utilized modern CSS techniques, including Flexbox, to create responsive layouts, ensuring an optimal user experience across various devices.\n\nThroughout the development process, I prioritized the responsiveness and adaptability of the application, enabling users to seamlessly interact with the platform on desktops, laptops, tablets, and mobile devices.\n\nUnsung Heroes shows my expertise in ReactJS and showcases my ability to deliver a visually appealing and user-friendly web application."
    }
  },
  {
    "title": "MUTT Board Quiz",
    "images": [
      "images/muttQuiz/mutt1.png",
      "images/muttQuiz/mutt2.png",
      "images/muttQuiz/mutt3.png",
      "images/muttQuiz/muttvid.mp4"

    ],
    "link": "",
    "tools": [
      "ReactJS",
      "JavaScript",
      "HTML",
      "CSS",
      "CSS Animations"
    ],
    "description": {
      "brief": "MUTT Board Quiz is a visually impactful web application developed with ReactJS to increase interest in the Digital Corps. It features engaging quizzes related to the various work performed by the Digital Corps, utilizing React and CSS animations to enhance the user experience and encourage participation.",
      "long": "The MUTT Board Quiz is an engaging web application built with React, aimed at promoting participation and recognition of the BSU Digital Corps. It is displayed on a large touch screen for everyone to see. Incorporating engaging CSS animations, this project demonstrates my ability to create interactive experiences that leave a lasting impact.\n\nDesigned to be displayed on a prominent hall board, the MUTT Board Quiz invites users to interact with a series of captivating questions and challenges related to the Digital Corps. The use of React ensures a seamless and responsive user experience, while the incorporation of dynamic CSS animations adds an element of excitement and entertainment.\n\nBy leveraging React's capabilities, I created a user-friendly interface that guides participants through the quiz effortlessly. Through its interactive nature and captivating presentation, The MUTT Board Quiz successfully achieves its goal of increasing participation and recognition of the digital corps, while fostering engagement among users.\n\nIn summary, the MUTT Board Quiz showcases my skills in building interactive web applications using React, along with an understanding of CSS animations. Its impact lies in promoting participation and recognition of the digital corps in an engaging and memorable way.\n"
    }
  },
  {
    "title": "CCIM Quiz",
    "images": [
      "images/ccimQuiz/ccim1.png",
      "images/ccimQuiz/ccim3.png",
      "images/ccimQuiz/ccim4.png",
      "images/ccimQuiz/ccim6.png",
      "images/ccimQuiz/ccim7.png",
      "images/ccimQuiz/ccimvid.mp4"
    ],
    "link": "https://ccimquiz.apsoprojects.org/",
    "tools": [
      "ReactJS",
      "JavaScript",
      "HTML",
      "CSS",
      "CSS Animations"
    ],
    "description": {
      "brief": "The CCIM Quiz is a dynamic web application developed using ReactJS. It serves as a helpful tool for incoming freshmen, allowing them to determine which professors align with their preferences and characteristics. The quiz pulls data from a JSON file, ensuring flexibility and easy updates.",
      "long": "The CCIM Quiz is an innovative web application designed specifically for incoming freshmen at the CCIM. The goal of the project was to assist students in selecting professors who resonate with their preferences and characteristics. Built with ReactJS, JavaScript, and CSS animations, this quiz offers a dynamic and interactive experience. The React site is able to dynamically pull quiz questions and options from a JSON file. This approach ensures flexibility and easy updates, allowing the quiz to be adapted as needed without the need for hardcoding. By leveraging ReactJS's component-based architecture, the application efficiently renders the quiz content based on the data retrieved from the JSON file. A notable achievement within this project lies in the implementation of CSS animations. One particular animation that stands out is the unique behavior where pressing an option triggers a red button animation, starting precisely from the location the user clicks on. This feature required determining the exact mouse position and initiating the CSS animation from that precise point. The result is an engaging and visually appealing interaction that enhances the user experience. In contrast to using a grid of squares, which is a common approach, the CCIM Quiz leverages the exact location where the user presses on an option. This level of precision contributes to a more immersive and intuitive user interface. By personalizing the animation to the user's specific interaction, the application showcases a high level of attention to detail and provides a seamless and enjoyable user experience. The web application's responsive design ensures that incoming freshmen can access and take the quiz on various devices, including desktops, laptops, tablets, and mobile phones. This adaptability allows students to conveniently explore and engage with the quiz, regardless of their preferred device. Overall, the CCIM Quiz demonstrates the capabilities of ReactJS, JavaScript, HTML, CSS, and CSS animations in creating an interactive and visually appealing web application. Its ability to assist incoming freshmen in selecting professors who align with their preferences, combined with the unique button animation, highlights the project's impact on enhancing the user experience and promoting informed decision-making. By providing an intuitive and personalized quiz experience, the CCIM Quiz empowers students to make informed choices about their academic journey, fostering a positive and tailored learning environment within the CCIM."
    }
  },
  {
    "title": "Digital Corps HQ Backend",
    "link": "",
    "tools": [
      "AdonisJS",
      "Node.js",
      "MySQL",
      "Next.js"
    ],
    "description": {
      "brief": "The Digital Corps HQ Backend is a transformative project that aims to change the project intake process within the Digital Corps. By moving away from spreadsheets and adopting a comprehensive database solution, this backend system facilitates efficient management of teams, employees, clients, projects, and more.",
      "long": "The Digital Corps HQ Backend project represents a significant milestone in streamlining the project intake process within the Digital Corps. With the goal of replacing outdated spreadsheet-based workflows, the backend system offers a comprehensive database solution built with AdonisJS, Node.js, MySQL, and Next.js. One of the primary objectives of the Digital Corps HQ Backend is to centralize and organize critical project information. By leveraging AdonisJS, a robust and scalable Node.js framework, the backend system enables efficient storage and retrieval of data related to teams, employees, clients, and projects, among other things. This ensures that all essential information is easily accessible and securely managed. Next.js, a popular React framework, is employed to facilitate the transition from the previous Create React App setup. Next.js offers enhanced server-side rendering (SSR) capabilities, improved SEO performance, and advanced routing features. By utilizing Next.js, the Digital Corps HQ Backend ensures an improved overall project intake functionality. While the backend implementation is complete, the ongoing development focuses on building the front-end dashboard. This dashboard will serve as a comprehensive interface to facilitate data intake and display. By leveraging the power of React and Next.js, the front-end dashboard will provide an intuitive and user-friendly experience, empowering the Digital Corps project management team to efficiently handle project intake, assign resources, track progress, and generate meaningful reports. The Digital Corps HQ Backend project represents a significant step forward in transforming the project intake process within the Digital Corps. By replacing spreadsheets with a robust AdonisJS backend, supported by Node.js, MySQL, and Next.js, the system centralizes data, improves data management efficiency, and lays the groundwork for the development of a powerful front-end dashboard. By establishing a solid foundation for project intake, the backend system sets the stage for increased productivity, streamlined workflows, and improved decision-making processes within the Digital Corps."
    }
  },
  {
    "title": "Diverse Purchasing website",
    "images": [
      "images/purchasing/purchasing1.png",
      "images/purchasing/purchasing2.png"
    ],

    "link": "https://purchasing.apsoprojects.org",
    "tools": [
      "ReactJS",
      "and stuff"
    ],
    "description": {
      "brief": "",
      "long": ""
    }
  }
]